Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ09GS302.h
#define _IPC20_JTAGIP2_POSITION                  0x00000002
#define _IPC20_JTAGIP2_MASK                      0x00000004
#define _IPC20_JTAGIP2_LENGTH                    0x00000001

#define _IPC23_PWM1IP_POSITION                   0x00000008
#define _IPC23_PWM1IP_MASK                       0x00000700
#define _IPC23_PWM1IP_LENGTH                     0x00000003

#define _IPC23_PWM2IP_POSITION                   0x0000000C
#define _IPC23_PWM2IP_MASK                       0x00007000
#define _IPC23_PWM2IP_LENGTH                     0x00000003

#define _IPC23_PWM1IP0_POSITION                  0x00000008
#define _IPC23_PWM1IP0_MASK                      0x00000100
#define _IPC23_PWM1IP0_LENGTH                    0x00000001

#define _IPC23_PWM1IP1_POSITION                  0x00000009
#define _IPC23_PWM1IP1_MASK                      0x00000200
#define _IPC23_PWM1IP1_LENGTH                    0x00000001

#define _IPC23_PWM1IP2_POSITION                  0x0000000A
#define _IPC23_PWM1IP2_MASK                      0x00000400
#define _IPC23_PWM1IP2_LENGTH                    0x00000001

#define _IPC23_PWM2IP0_POSITION                  0x0000000C
#define _IPC23_PWM2IP0_MASK                      0x00001000
#define _IPC23_PWM2IP0_LENGTH                    0x00000001

#define _IPC23_PWM2IP1_POSITION                  0x0000000D
#define _IPC23_PWM2IP1_MASK                      0x00002000
#define _IPC23_PWM2IP1_LENGTH                    0x00000001

#define _IPC23_PWM2IP2_POSITION                  0x0000000E
#define _IPC23_PWM2IP2_MASK                      0x00004000
#define _IPC23_PWM2IP2_LENGTH                    0x00000001

#define _IPC24_PWM4IP_POSITION                   0x00000004
#define _IPC24_PWM4IP_MASK                       0x00000070
#define _IPC24_PWM4IP_LENGTH                     0x00000003

#define _IPC25_AC2IP_POSITION                    0x0000000C
#define _IPC25_AC2IP_MASK                        0x00007000
#define _IPC25_AC2IP_LENGTH                      0x00000003

#define _IPC25_AC2IP0_POSITION                   0x0000000C
#define _IPC25_AC2IP0_MASK                       0x00001000
#define _IPC25_AC2IP0_LENGTH                     0x00000001

#define _IPC25_AC2IP1_POSITION                   0x0000000D
#define _IPC25_AC2IP1_MASK                       0x00002000
#define _IPC25_AC2IP1_LENGTH                     0x00000001

#define _IPC25_AC2IP2_POSITION                   0x0000000E
#define _IPC25_AC2IP2_MASK                       0x00004000
#define _IPC25_AC2IP2_LENGTH                     0x00000001

#define _IPC27_ADCP0IP_POSITION                  0x00000008
#define _IPC27_ADCP0IP_MASK                      0x00000700
#define _IPC27_ADCP0IP_LENGTH                    0x00000003

#define _IPC27_ADCP1IP_POSITION                  0x0000000C
#define _IPC27_ADCP1IP_MASK                      0x00007000
#define _IPC27_ADCP1IP_LENGTH                    0x00000003

#define _IPC27_ADCP0IP0_POSITION                 0x00000008
#define _IPC27_ADCP0IP0_MASK                     0x00000100
#define _IPC27_ADCP0IP0_LENGTH                   0x00000001

#define _IPC27_ADCP0IP1_POSITION                 0x00000009
#define _IPC27_ADCP0IP1_MASK                     0x00000200
#define _IPC27_ADCP0IP1_LENGTH                   0x00000001

#define _IPC27_ADCP0IP2_POSITION                 0x0000000A
#define _IPC27_ADCP0IP2_MASK                     0x00000400
#define _IPC27_ADCP0IP2_LENGTH                   0x00000001

#define _IPC27_ADCP1IP0_POSITION                 0x0000000C
#define _IPC27_ADCP1IP0_MASK                     0x00001000
#define _IPC27_ADCP1IP0_LENGTH                   0x00000001

#define _IPC27_ADCP1IP1_POSITION                 0x0000000D
#define _IPC27_ADCP1IP1_MASK                     0x00002000
#define _IPC27_ADCP1IP1_LENGTH                   0x00000001

#define _IPC27_ADCP1IP2_POSITION                 0x0000000E
#define _IPC27_ADCP1IP2_MASK                     0x00004000
#define _IPC27_ADCP1IP2_LENGTH                   0x00000001

#define _IPC28_ADCP2IP_POSITION                  0x00000000
#define _IPC28_ADCP2IP_MASK                      0x00000007
#define _IPC28_ADCP2IP_LENGTH                    0x00000003

#define _IPC28_ADCP3IP_POSITION                  0x00000004
#define _IPC28_ADCP3IP_MASK                      0x00000070
#define _IPC28_ADCP3IP_LENGTH                    0x00000003

#define _IPC28_ADCP2IP0_POSITION                 0x00000000
#define _IPC28_ADCP2IP0_MASK                     0x00000001
#define _IPC28_ADCP2IP0_LENGTH                   0x00000001

#define _IPC28_ADCP2IP1_POSITION                 0x00000001
#define _IPC28_ADCP2IP1_MASK                     0x00000002
#define _IPC28_ADCP2IP1_LENGTH                   0x00000001

#define _IPC28_ADCP2IP2_POSITION                 0x00000002
#define _IPC28_ADCP2IP2_MASK                     0x00000004
#define _IPC28_ADCP2IP2_LENGTH                   0x00000001

#define _IPC29_ADCP6IP_POSITION                  0x00000000
#define _IPC29_ADCP6IP_MASK                      0x00000007
#define _IPC29_ADCP6IP_LENGTH                    0x00000003

#define _IPC29_ADCP6IP0_POSITION                 0x00000000
#define _IPC29_ADCP6IP0_MASK                     0x00000001
#define _IPC29_ADCP6IP0_LENGTH                   0x00000001

#define _IPC29_ADCP6IP1_POSITION                 0x00000001
#define _IPC29_ADCP6IP1_MASK                     0x00000002
#define _IPC29_ADCP6IP1_LENGTH                   0x00000001

#define _IPC29_ADCP6IP2_POSITION                 0x00000002
#define _IPC29_ADCP6IP2_MASK                     0x00000004
#define _IPC29_ADCP6IP2_LENGTH                   0x00000001

#define _INTTREG_VECNUM_POSITION                 0x00000000
#define _INTTREG_VECNUM_MASK                     0x0000007F
#define _INTTREG_VECNUM_LENGTH                   0x00000007

#define _INTTREG_ILR_POSITION                    0x00000008
#define _INTTREG_ILR_MASK                        0x00000F00
#define _INTTREG_ILR_LENGTH                      0x00000004

#define _INTTREG_VECNUM0_POSITION                0x00000000
#define _INTTREG_VECNUM0_MASK                    0x00000001
#define _INTTREG_VECNUM0_LENGTH                  0x00000001

#define _INTTREG_VECNUM1_POSITION                0x00000001
#define _INTTREG_VECNUM1_MASK                    0x00000002
#define _INTTREG_VECNUM1_LENGTH                  0x00000001

#define _INTTREG_VECNUM2_POSITION                0x00000002
#define _INTTREG_VECNUM2_MASK                    0x00000004
#define _INTTREG_VECNUM2_LENGTH                  0x00000001

#define _INTTREG_VECNUM3_POSITION                0x00000003
#define _INTTREG_VECNUM3_MASK                    0x00000008
#define _INTTREG_VECNUM3_LENGTH                  0x00000001

