Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ09GS302.h
#define _ADCPC1_PEND3_POSITION                   0x0000000E
#define _ADCPC1_PEND3_MASK                       0x00004000
#define _ADCPC1_PEND3_LENGTH                     0x00000001

#define _ADCPC1_IRQEN3_POSITION                  0x0000000F
#define _ADCPC1_IRQEN3_MASK                      0x00008000
#define _ADCPC1_IRQEN3_LENGTH                    0x00000001

#define _ADCPC1_TRGSRC20_POSITION                0x00000000
#define _ADCPC1_TRGSRC20_MASK                    0x00000001
#define _ADCPC1_TRGSRC20_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC21_POSITION                0x00000001
#define _ADCPC1_TRGSRC21_MASK                    0x00000002
#define _ADCPC1_TRGSRC21_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC22_POSITION                0x00000002
#define _ADCPC1_TRGSRC22_MASK                    0x00000004
#define _ADCPC1_TRGSRC22_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC23_POSITION                0x00000003
#define _ADCPC1_TRGSRC23_MASK                    0x00000008
#define _ADCPC1_TRGSRC23_LENGTH                  0x00000001

#define _ADCPC1_TRGSRC24_POSITION                0x00000004
#define _ADCPC1_TRGSRC24_MASK                    0x00000010
#define _ADCPC1_TRGSRC24_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC6_POSITION                 0x00000000
#define _ADCPC3_TRGSRC6_MASK                     0x0000001F
#define _ADCPC3_TRGSRC6_LENGTH                   0x00000005

#define _ADCPC3_SWTRG6_POSITION                  0x00000005
#define _ADCPC3_SWTRG6_MASK                      0x00000020
#define _ADCPC3_SWTRG6_LENGTH                    0x00000001

#define _ADCPC3_PEND6_POSITION                   0x00000006
#define _ADCPC3_PEND6_MASK                       0x00000040
#define _ADCPC3_PEND6_LENGTH                     0x00000001

#define _ADCPC3_IRQEN6_POSITION                  0x00000007
#define _ADCPC3_IRQEN6_MASK                      0x00000080
#define _ADCPC3_IRQEN6_LENGTH                    0x00000001

#define _ADCPC3_TRGSRC60_POSITION                0x00000000
#define _ADCPC3_TRGSRC60_MASK                    0x00000001
#define _ADCPC3_TRGSRC60_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC61_POSITION                0x00000001
#define _ADCPC3_TRGSRC61_MASK                    0x00000002
#define _ADCPC3_TRGSRC61_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC62_POSITION                0x00000002
#define _ADCPC3_TRGSRC62_MASK                    0x00000004
#define _ADCPC3_TRGSRC62_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC63_POSITION                0x00000003
#define _ADCPC3_TRGSRC63_MASK                    0x00000008
#define _ADCPC3_TRGSRC63_LENGTH                  0x00000001

#define _ADCPC3_TRGSRC64_POSITION                0x00000004
#define _ADCPC3_TRGSRC64_MASK                    0x00000010
#define _ADCPC3_TRGSRC64_LENGTH                  0x00000001

#define _PTCON_SEVTPS_POSITION                   0x00000000
#define _PTCON_SEVTPS_MASK                       0x0000000F
#define _PTCON_SEVTPS_LENGTH                     0x00000004

#define _PTCON_SYNCSRC_POSITION                  0x00000004
#define _PTCON_SYNCSRC_MASK                      0x00000030
#define _PTCON_SYNCSRC_LENGTH                    0x00000002

#define _PTCON_SYNCEN_POSITION                   0x00000007
#define _PTCON_SYNCEN_MASK                       0x00000080
#define _PTCON_SYNCEN_LENGTH                     0x00000001

#define _PTCON_SYNCOEN_POSITION                  0x00000008
#define _PTCON_SYNCOEN_MASK                      0x00000100
#define _PTCON_SYNCOEN_LENGTH                    0x00000001

#define _PTCON_SYNCPOL_POSITION                  0x00000009
#define _PTCON_SYNCPOL_MASK                      0x00000200
#define _PTCON_SYNCPOL_LENGTH                    0x00000001

#define _PTCON_EIPU_POSITION                     0x0000000A
#define _PTCON_EIPU_MASK                         0x00000400
#define _PTCON_EIPU_LENGTH                       0x00000001

#define _PTCON_SEIEN_POSITION                    0x0000000B
#define _PTCON_SEIEN_MASK                        0x00000800
#define _PTCON_SEIEN_LENGTH                      0x00000001

#define _PTCON_SESTAT_POSITION                   0x0000000C
#define _PTCON_SESTAT_MASK                       0x00001000
#define _PTCON_SESTAT_LENGTH                     0x00000001

#define _PTCON_PTSIDL_POSITION                   0x0000000D
#define _PTCON_PTSIDL_MASK                       0x00002000
#define _PTCON_PTSIDL_LENGTH                     0x00000001

#define _PTCON_PTEN_POSITION                     0x0000000F
#define _PTCON_PTEN_MASK                         0x00008000
#define _PTCON_PTEN_LENGTH                       0x00000001

#define _PTCON_SEVTPS0_POSITION                  0x00000000
#define _PTCON_SEVTPS0_MASK                      0x00000001
#define _PTCON_SEVTPS0_LENGTH                    0x00000001

#define _PTCON_SEVTPS1_POSITION                  0x00000001
#define _PTCON_SEVTPS1_MASK                      0x00000002
#define _PTCON_SEVTPS1_LENGTH                    0x00000001

#define _PTCON_SEVTPS2_POSITION                  0x00000002
#define _PTCON_SEVTPS2_MASK                      0x00000004
#define _PTCON_SEVTPS2_LENGTH                    0x00000001

#define _PTCON_SEVTPS3_POSITION                  0x00000003
#define _PTCON_SEVTPS3_MASK                      0x00000008
#define _PTCON_SEVTPS3_LENGTH                    0x00000001

#define _PTCON_SYNCSRC0_POSITION                 0x00000004
#define _PTCON_SYNCSRC0_MASK                     0x00000010
#define _PTCON_SYNCSRC0_LENGTH                   0x00000001

#define _PTCON_SYNCSRC1_POSITION                 0x00000005
#define _PTCON_SYNCSRC1_MASK                     0x00000020
#define _PTCON_SYNCSRC1_LENGTH                   0x00000001

#define _PTCON2_PCLKDIV_POSITION                 0x00000000
#define _PTCON2_PCLKDIV_MASK                     0x00000007
#define _PTCON2_PCLKDIV_LENGTH                   0x00000003

#define _PTCON2_PCLKDIV0_POSITION                0x00000000
#define _PTCON2_PCLKDIV0_MASK                    0x00000001
#define _PTCON2_PCLKDIV0_LENGTH                  0x00000001

